//
//  Professions.swift
//  HomeWorkUITableView
//
//  Created by Денис Шишкин on 12.01.2023.
//

import Foundation

struct Professions: Hashable {
  let userName: String
  let prof: String
  let discrip: String
  
  
  static func ProffDiscrip () -> [Self] {
    [
      Professions(userName: "Семенов Степан", prof: "Разработчик",  discrip: "Разработчик – широкий термин для группы специалистов, работа которых направлена на создание мобильных и компьютерных приложений, игр, баз данных и прочего программного обеспечения самых различных устройств. Разработчики в своей деятельности умело совмещают творческий подход и строгий язык программирования."),
      Professions(userName: "Сергей Громов", prof: "Аналитик bi (Business Analyst)", discrip: "Аналитик bi (Business Analyst) — специалист, изучающий структуру бизнес-процессов и общую модель менеджмента в компании. Это необходимо, чтобы обнаружить «болезненные точки» и выработать пути решения проблем."),
      Professions(userName: "Алексей Белов", prof: "Тестировщик", discrip: "Тестировщик – это квалифицированный специалист, занимающийся тестированием мобильных приложений, десктопных программ, веб-приложений и другого софта до его официального выхода. В ходе работы тестировщик проверяет наличие ошибок, находит уязвимости, смотрит, адаптировано ли приложение под разные устройства, и выполняет много других операций."),
      Professions(userName: "Иван Кузнецов", prof: "Охотник", discrip: "Охотник – древняя профессия. Охотник может работать в заповедниках, охотничьих хозяйствах. Функциональные и должностные обязанности охотника. Охотник работает на благо природы, отвечает за сохранность и развитие природных богатств: занимается отстрелом промысловых животных, размножением и разведением новых видов птиц и животных, подкармливает их, снимает, сушит шкурки с пушных зверей, ведет борьбу с браконьерством."),
      Professions(userName: "Марк Иванов", prof: "Дизайнер", discrip: "Дизайнер – это специалист, который занимается художественным оформлением каких-либо объектов. Это может быть помещение, продукт, веб-страница, здание, одежда, предметы интерьера и виртуальная реальность. Промышленный, графический, индустриальный дизайн, веб-дизайн, дизайн интерфейсов – у этой профессии десятки специализаций, а значит и десятки категорий специалистов."),
      Professions(userName: "Григорий Степанов", prof: "Повар", discrip: "Повар – это специалист, занимающийся приготовлением пищи. Он знает, как определить качество продуктов, как их правильно хранить, сочетать и готовить. В процессе приготовления повар должен придерживаться рецептуры и рекомендованных технологий, но при необходимости он может проявить творческий подход и создать что-то свое."),
      Professions(userName: "Петр Вернов ", prof: "Юрист", discrip: "Юрист – квалифицированный специалист с высшим юридическим образованием по правовым вопросам, юридическим наукам."),
      Professions(userName: "Максим Совин", prof: "Психолог", discrip: "Психолог-это профессионал, который практикует психологию и изучает нормальные и аномальные психические состояния, перцептивные, когнитивные, эмоциональные и социальные процессы и поведение, экспериментируя, наблюдая, интерпретируя и записывая, как люди относятся друг к другу и к своему окружению."),
      Professions(userName: "Екатерина Павлова", prof: "Учитель", discrip: "Учитель это специалист, который занимается обучением и воспитанием детей, а также профессиональной подготовкой взрослых."),
      Professions(userName: "Светлана Серегина", prof: "Писатель", discrip: "Писатель – это работник творческого труда, который сочиняет литературные произведения."),
    ]
  }
  
}
